/*
 * ------------------------------------------------------ *
 * @file	: Constant.h
 * @brief	: 定数を記述する
 * ------------------------------------------------------ *
 */
#ifndef _CONSTANT_H_
#define _CONSTANT_H_


/*
 * ------------------------------------------------------ *
 * @brief	: サウンド名の宣言
 * ------------------------------------------------------ *
 */
#define CREATE_SONG       0
#define MODULE_SONG       1
#define USER_HW_SONG      2
#define DEBUG_SONG        3
#define CHARGE_START_SONG 4


/*
 * ------------------------------------------------------ *
 * @brief	: シリアル通信先の宣言
 * ------------------------------------------------------ *
 */
#define USB 1
#define CRB 2


/*
 * ------------------------------------------------------ *
 * @brief	: ビット操作用マクロ
 * ------------------------------------------------------ *
 */
#define	_BV(bit) (1	<<	(bit))
#define	 BV(bit) _BV(bit)


/*
 * ------------------------------------------------------ *
 * @brief	: 壁伝い走行用PID制御パラメータ
 * ------------------------------------------------------ *
 */
#define KP  0.6
#define KI  2.0
#define KD  0.12
#define TIME 0.10


#endif
